# # 对列表进行切片
# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[0:5:1]
# print(list2)  # [10, 20, 30, 40, 50]
#
# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[2:8:3]
# print(list2)


#
# # 当起始索引大于结束索引时，步长必须为负数，否则结果是空列表。
# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[7:2:-2]
# print(list2)  # [80, 70, 60, 50, 40]


# # 对元组进行切片
# tuple1 = (10, 20, 30, 40, 50, 60, 70, 80, 90, 100)
# print(tuple1)
# tuple2 = tuple1[7:2:-2]
# print(tuple2)  # (80, 70, 60, 50, 40)
#
# #对字符串进行切片
# str1='hello world'
# print(str1[0:5])
# print(str1[2:10:2])

